Tekla.Structures.Analysis.AnalysisSupport.SupportEnum
The connectivity types.

Tekla.Structures.Analysis.AnalysisSupport.SupportEnum.SUPPORT_FREE
The support is free.

Tekla.Structures.Analysis.AnalysisSupport.SupportEnum.SUPPORT_FIXED
The support is fixed.

Tekla.Structures.Analysis.AnalysisSupport.SupportEnum.SUPPORT_SPRING
The support is a spring.